#+BEGIN_COMMENT
.. title: The Red-Black Tree: Nodes
.. slug: the-red-black-tree-nodes
.. date: 2022-03-19 15:58:42 UTC-07:00
.. tags: data structures,binary search trees,algorithms,red-black trees
.. category: Data Structures
.. link: 
.. description: 
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-b9537502-1535-4851-9ec2-563565de8238-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
#+begin_src python :tangle ../bowling/data_structures/red_black_tree/tree.py :exports none
<<imports>>


<<color>>


<<the-nil>>


<<the-node>>

    <<parent>>

    <<left>>

    <<right>>

    <<equal>>

    <<less-than>>

    <<less-than-or-equal>>

    <<check-rep>>

    <<string-output>>
#+end_src
This is a post that implements the Node for a Red-Black Tree. It is a continuation of {{% lancelot "this post" %}}red-black-trees{{% /lancelot %}}.
*** Color
#+begin_src python :noweb-ref color
class Color(Enum):
    """red or black"""
    RED = 1
    BLACK = 2
#+end_src

#+begin_src python :results none
from bowling.data_structures.red_black_tree import tree
#+end_src

#+begin_src python :results output :exports both
print(tree.Color.RED)
print(tree.Color.BLACK)

red = tree.Color.RED
print(red is tree.Color.RED)
print(red == tree.Color.RED)
print(red == 1)
#+end_src

#+RESULTS:
: Color.RED
: Color.BLACK
: True
: True
: False

Note that last case (~print(red==1)~). It's ~False~ because I'm using an Enum. We could switch it to an [[https://docs.python.org/3/library/enum.html#intenum][IntEnum]] and allow integers but for now I'm sticking to the Enum to see how well it works.

*** The Nil Node
#+begin_src python :noweb-ref the-nil
NIL_KEY = "NIL"
NIL = namedtuple("NIL", ["key", "color", "parent", "left", "right"],
                 defaults=[NIL_KEY, Color.BLACK, None, None, None])()
#+end_src

#+begin_src python :results output :exports both
print(tree.NIL)
expect(tree.NIL.color).to(equal(tree.Color.BLACK))
#+end_src

#+RESULTS:
: NIL(key='NIL', color=<Color.BLACK: 2>)

